Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Exemplars additional tracing information about the metric. In this case, the traceId and spanId of one os the request that triggered the metric, since it was last sent.
ja_jp: メトリクスに関する追加のトレース情報の例。 この場合、traceId と spanId は、最後に送信されてからメトリクスをトリガーしたリクエストのいずれかになります。

source: Existing Extension codestarts
ja_jp: 既存のエクステンションのコードスタート

source: Expanding the API
ja_jp: APIの拡張

source: Expect many new features in the Quarkus CLI in the form of plugins in the near future.
ja_jp: 近い将来、プラグインの形でQuarkus CLIに多くの新機能が追加されるでしょう。

source: Expect more development and announcements in the coming months.
ja_jp: 今後の展開と発表にご期待ください。

source: Expected format for the Quarkus Header sub-protocol is `quarkus-http-upgrade#header-name#header-value`. Do not forget to encode the sub-protocol value as a URI component to avoid encoding issues.
ja_jp: Quarkus Header サブプロトコルの想定される形式は `quarkus-http-upgrade#header-name#header-value` です。 エンコードの問題を回避するために、サブプロトコル値を URI コンポーネントとしてエンコードすることを忘れないでください。

source: Experimental - not included in the MicroProfile specification
ja_jp: 実験的 - MicroProfileの仕様に含まれません

source: Expiration
ja_jp: 有効期限

source: Expiration grace in seconds. By default an expired token will still be accepted if the current time is no more than 1 min after the token expiry time.
ja_jp: 有効期限の猶予 (秒単位)。デフォルトでは、現在の時刻がトークンの有効期限から 1 分以内であれば、期限切れのトークンは引き続き受け入れられます。

source: Expiration grace in seconds. By default an expired token will still be accepted if the current time is no more than 1 min after the token expiry time. This property is deprecated. Use `mp.jwt.verify.clock.skew` instead.
ja_jp: 有効期限を秒単位で指定します。デフォルトでは、現在時刻がトークンの有効期限から1分以内であれば、期限切れのトークンはまだ受け入れられます。このプロパティは非推奨です。代わりに `mp.jwt.verify.clock.skew` を使用してください。

source: Expiration grace in seconds. By default, an expired token is still accepted if the current time is no more than 1 min after the token expiry time. This property is deprecated. Use `mp.jwt.verify.clock.skew` instead.
ja_jp: 有効期限を秒単位で指定します。デフォルトでは、現在時刻がトークンの有効期限から 1 分以内であれば、期限切れのトークンはまだ受け入れられます。このプロパティーは非推奨です。代わりに `mp.jwt.verify.clock.skew` を使用してください。

source: Expiration grace in seconds. By default, an expired token will still be accepted if the current time is no more than 1 min after the token expiry time.
ja_jp: 有効期限の猶予 (秒単位)。デフォルトでは、現在の時刻がトークンの有効期限から 1 分以内であれば、期限切れのトークンは引き続き受け入れられます。

source: Explain existing code in you application
ja_jp: アプリケーション内の既存コードの解説

source: Explanation is _discussion_ that clarifies and illuminates a particular topic. Explanation is _understanding-oriented_.
ja_jp: 説明は、特定のトピックを明確にし、わかりやすくする _ディスカッション_ です。説明は _理解を重視_ しています。

source: Explanation of the flow for WebAuthn authentication.
ja_jp: WebAuthn 認証のフローの説明

source: Explanations of some of the larger concepts and technologies involved with Quarkus.
ja_jp: Quarkusに関連するいくつかの大きな概念と技術についての説明。

source: Explicit composite cache key
ja_jp: 明示的な複合キャッシュキー

source: Explicitly using the plugin commands
ja_jp: プラグインコマンドの明示的な使用

source: Explore
ja_jp: 探索

source: Explore all the BuildItems you can consume/produce in your extensions.
ja_jp: エクステンションで消費/生産できるすべての BuildItems を調べてみましょう。

source: Explore continuous development and test
ja_jp: 継続的な開発とテストについて調べる

source: Explore in more details how to debug native executables.
ja_jp: ネイティブ実行可能ファイルをデバッグする方法について詳しく説明します。

source: Explore the Quarkus developer toolchain which makes Quarkus development so fast and enjoyable.
ja_jp: Quarkusの開発を非常に高速で楽しいものにするQuarkus開発者ツールチェーンをご紹介します。

source: Explore the Solution
ja_jp: ソリューションの探索

source: Explore the solution
ja_jp: ソリューションの探索

source: Explore the wide breadth of technologies Quarkus with which applications can be made.
ja_jp: アプリケーション作成に使用できる、Quarkusの幅広いテクノロジーをご覧ください。

source: Exploring our performance
ja_jp: パフォーマンスの探求

source: Export Quarkus Security events as OpenTelemetry Span events.
ja_jp: Quarkus Security イベントを OpenTelemetry Span イベントとしてエクスポートします。

source: Exported metrics format
ja_jp: エクスポートされるメトリクス形式

source: Exporter protocol. OLTP is the OpenTelemetry protocol.
ja_jp: エクスポートプロトコル。OLTP は OpenTelemetry プロトコルです。

source: Exporters
ja_jp: エクスポーター

source: Expose OpenAPI Specifications
ja_jp: OpenAPI仕様を公開

source: Expose Quarkus Apps metrics into OpenShift using Micrometer and Prometheus
ja_jp: MicrometerとPrometheusを使ってQuarkus AppsのメトリクスをOpenShiftに公開

source: Expose The Service - OpenShift CLI Example
ja_jp: サービスの公開 - OpenShift CLIの例

source: Expose a Podman service for usage with Quarkus Dev Services and Testcontainers
ja_jp: 以下のコマンドでQuarkus Dev ServicesとTestcontainersで動作するようにPodmanと環境変数をセットアップします。

source: Expose a REST Resource
ja_jp: RESTリソースを公開する

source: Expose a dedicated url for referncing this target
ja_jp: このターゲットを参照するための専用URLを公開します。

source: Expose the service to the outside world.
ja_jp: サービスを外部に公開します。

source: Expose the service.
ja_jp: サービスの公開

source: Expose your components via CDI
ja_jp: CDI でコンポーネントを公開する

source: Expose your implementation as a bean.
ja_jp: 実装をBeanとして公開します。

source: Exposed Port
ja_jp: 公開ポート

source: Exposes information about all the hosts forming the application cluster
ja_jp: アプリケーションクラスタを形成するすべてのホストに関する情報を公開する

source: Exposing Routes
ja_jp: Route の公開

source: Exposing Service Configuration into the Application
ja_jp: サービス設定をアプリケーションに公開する

source: Exposing an endpoint on the management interface (as an application)
ja_jp: (アプリケーションとして) マネジメントインタフェース上でエンドポイントを公開

source: Exposing many entities
ja_jp: 大量のエンティティの公開

source: Exposing port mappings to running containers
ja_jp: 実行中のコンテナーへのポートマッピングの公開

source: Exposing routes
ja_jp: ルートの公開

source: Exposing with Secured Ingress
ja_jp: セキュアなIngressで公開

source: Exposing your application in Kubernetes
ja_jp: アプリケーションをKubernetesに公開

source: Exposing your entities to Quarkus WebAuthn
ja_jp: Quarkus WebAuthnにエンティティを公開する

source: Expressions
ja_jp: 式

source: Expressions lookups are performed in all config sources. The expression values and expansion values may reside in different config sources.
ja_jp: 式のルックアップは、すべての設定ソースで実行されます。式の値と展開値は、異なる設定ソースに存在する場合があります。

source: Expressions that reference a message bundle method, such as `{msg:hello(item.name)}`, are validated too.
ja_jp: `{msg:hello(item.name)}` のようなメッセージバンドルメソッドを参照する式も検証されます。

source: Extend and customize the Configuration.
ja_jp: 設定の拡張、カスタマイズ

source: Extending Configuration Support
ja_jp: 設定サポートの拡張

source: Extending Stork
ja_jp: Storkの拡張

source: Extending the CLI
ja_jp: CLIの拡張

source: Extending the image
ja_jp: イメージの拡張

source: Extends `GeneratedSchema` Protostream API interface
ja_jp: Protostream API の `GeneratedSchema` インターフェースを実装します。

source: Extends the `ImplBase` class. This is a generated class.
ja_jp: `ImplBase` クラスを拡張します。生成されたクラスです。

source: Extensible service discovery mechanisms
ja_jp: 拡張可能なサービスディスカバリーメカニズム

source: Extension
ja_jp: エクステンション

source: Extension Add
ja_jp: エクステンション追加

source: Extension Bean Injection Example
ja_jp: エクステンション Bean インジェクト例

source: Extension Capabilities
ja_jp: エクステンションケイパビリティ

source: Extension Documentation
ja_jp: エクステンションドキュメント

source: Extension Health Check
ja_jp: エクステンションヘルスチェック

source: Extension List
ja_jp: エクステンションリスト

source: Extension Method Example
ja_jp: 拡張メソッドの例

source: Extension Metrics
ja_jp: エクステンションメトリクス

source: Extension Points
ja_jp: 拡張ポイント

source: Extension Repository
ja_jp: エクステンションリポジトリー

source: Extension Status
ja_jp: エクステンションステータス

source: Extension Title Quarkiverse-JBeret
ja_jp: エクステンションのタイトル Quarkiverse-JBeret

source: Extension Version
ja_jp: エクステンションのバージョン

source: Extension Version: 1.1.1
ja_jp: エクステンションのバージョン: 1.1.1

source: Extension and connection pool class names for each client can be found at the bottom of this document.
ja_jp: 各クライアントのエクステンションと接続プールのクラス名は、このドキュメントの下部に記載されています。

source: Extension authors should not rely on static variables for cross-instance communication. They should not assume that the invocation order of processors will be the same as the run order of applications.
ja_jp: エクステンション開発者は、インスタンス間の通信を静的変数に依存すべきではありません。プロセッサーの呼び出し順序がアプリケーションの実行順序と同じになると想定してはいけません。

source: Extension code should never stop or start the Dev Service
ja_jp: エクステンションのコードで Dev Service を停止または開始してはいけません。

source: Extension codestart
ja_jp: エクステンション Codestart

source: Extension codestarts - A new way to learn & discover Quarkus
ja_jp: Extension codestarts - Quarkusを学び、発見する新しい方法

source: Extension codestarts are applied by default when using the Quarkus tooling (if the chosen extensions contain any):
ja_jp: エクステンション Codestart は、Quarkus ツールを使用するときにデフォルトで適用されます (選択したエクステンションに含まれている場合)。

source: Extension codestarts may provide a snippet for the generated index.html by adding this file:
ja_jp: エクステンションの Codestart では、このファイルを追加することで、生成されるindex.htmlにスニペットを提供することができます。

source: Extension codestarts should be able to work alongside each other without interference (in combination).
ja_jp: エクステンションCodestartは、互いに干渉することなく（組み合わせて）一緒に使えるべきです。

source: Extension developers that want to make their configuration options platform-specific should set their default values to properties that start with the `platform.` suffix. Here is an example:
ja_jp: 設定オプションをプラットフォーム固有のものにしたいエクステンションの開発者は、デフォルト値を `platform.` で始まるプロパティに設定しなければなりません。以下に例を示します。

source: Extension for Spring Data API
ja_jp: Spring Data API のエクステンション

source: Extension for Spring Data REST
ja_jp: Spring Data RESTのエクステンション

source: Extension for running Narayana LRA participants
ja_jp: Narayana LRA参加者の実行エクステンション

source: Extension health checks
ja_jp: エクステンションのヘルスチェック

source: Extension maven dependencies
ja_jp: エクステンションのmaven依存関係

source: Extension metadata
ja_jp: Extension メタデータ

source: Extension methods can be used to extend the data classes with new functionality (to extend the set of accessible properties and methods) or to resolve expressions for a specific <<namespace_extension_methods,namespace>>. For example, it is possible to add _computed properties_ and _virtual methods_.
ja_jp: エクステンションメソッドは、データクラスを新しい機能で拡張するため (アクセス可能なプロパティーとメソッドのセットを拡張するため)、または特定の <<namespace_extension_methods,namespace>> のための式を解決するために使用できます。 たとえば、_計算済みプロパティ_ や _仮想メソッド_ を追加できます。

source: Extension name
ja_jp: 拡張子名

source: Extension name displayed to users
ja_jp: ユーザーに表示されるエクステンション名

source: Extension offerings
ja_jp: エクステンション提供物

source: Extension or Dependency
ja_jp: エクステンションか依存関係

source: Extension pages that support AI-driven help
ja_jp: AI によるヘルプをサポートするエクステンションのページ

source: Extension philosophy
ja_jp: エクステンション哲学

source: Extension provided Dev mode Java options
ja_jp: エクステンションが提供する開発モードの Java オプション

source: Extension providing Initialization Tasks
ja_jp: 初期化タスクを提供するエクステンション

source: Extension runtime artifact expression that will be replaced with the actual coordinates during the build, this field could be omitted
ja_jp: ビルド時に実際の座標に置き換えられるエクステンションランタイムアーティファクト式、このフィールドは省略可

source: Extension writers will see the biggest change. The link:https://quarkus.io/guides/writing-extensions#extension-defined-endpoints[Writing extensions guide] has been updated to describe changes to the build items used to create non-application endpoints. The general rule, however, is to avoid constructing your own endpoint paths, and rely on `NonApplicationRootPathBuildItem` and `HttpRootPathBuildItem` to construct them for you.
ja_jp: エクステンション開発者は最も大きな変更点を目にすることになるでしょう。 link:https://quarkus.io/guides/writing-extensions#extension-defined-endpoints[エクステンション開発ガイド]が更新され、アプリケーション以外のエンドポイントを作成するために使用されるビルド項目の変更が記述されています。しかし、一般的なルールとしては、自分でエンドポイントパスを構築することは避け、 `NonApplicationRootPathBuildItem` と `HttpRootPathBuildItem` に頼って構築してもらうようにしましょう。

source: Extension-defined endpoints
ja_jp: エクステンションで定義されたエンドポイント

source: Extension-specific tools and UIs (e.g., GraphQL UI, Swagger UI)
ja_jp: エクステンション固有のツールと UI (例: GraphQL UI、Swagger UI)

source: Extensions
ja_jp: エクステンション

source: Extensions also use Dev UI hooks to present extra information to users. For example, the tile could include a link to an external console, or an internal page which presents simple text metrics. See the xref:dev-ui.adoc[Dev UI for extension developers] guide.
ja_jp: エクステンションは、Dev UI フックを使用して、ユーザーに追加情報を提示します。たとえば、タイルに外部コンソールへのリンクや、単純なテキストメトリクスを表示する内部ページを含めることができます。xref:dev-ui.adoc[エクステンション開発者向けの Dev UI] ガイドを参照してください。

source: Extensions and integrations for runtime and application observability
ja_jp: ランタイムとアプリケーションのobservabilityを高めるためのエクステンションと統合

source: Extensions and the libraries they provide, are directly instrumented in Quarkus. The *use of the https://opentelemetry.io/docs/instrumentation/java/automatic/[OpenTelemetry Agent] is not needed nor recommended* due to context propagation issues between imperative and reactive libraries.
ja_jp: エクステンションとそれが提供するライブラリは、Quarkusで直接インストルメント化されます。命令型ライブラリとリアクティブ型ライブラリの間のコンテキスト伝播の問題があるため、 *link:https://opentelemetry.io/docs/instrumentation/java/automatic/[OpenTelemetryエージェント] の使用は必要なく、推奨もされていません* 。

source: Extensions are free to customize their cards and add interactive behaviors based on what they provide at runtime.
ja_jp: エクステンションは、ランタイムで提供するものに基づいて、カードを自由にカスタマイズし、インタラクティブな動作を追加できます。

source: Extensions are passed using a comma-separated list.
ja_jp: エクステンションは、カンマ区切りのリストを使用して渡されます。

source: Extensions can also declare conditional dependencies on other extensions using dev mode as the condition or one of the conditions for those dependencies to be activated.
ja_jp: エクステンションは、開発モードを条件として使用したり、依存関係をアクティブ化するための条件の 1 つとして使用したりして、他のエクステンションに対する条件付き依存関係を宣言することもできます。

source: Extensions can be built with either Maven or Gradle. Depending on your build tool, setup can be done as following:
ja_jp: エクステンションは、MavenまたはGradleのいずれかでビルドできます。お使いのビルドツールに応じて、以下のようにセットアップを行います。

source: Extensions can consume registered capabilities using the `Capabilities` build item:
ja_jp: エクステンションは、 `Capabilities` ビルドアイテムを使用して、登録されたケイパビリティを消費することができます。

source: Extensions can contribute `actions` to items in the workspace.
ja_jp: エクステンションは、ワークスペース内の項目に `アクション` を提供できます。

source: Extensions can contribute additional tools and resources to the Dev MCP server. The integration is similar to contributing to the xref:dev-ui.adoc[Dev UI], but descriptions are mandatory. A single JSON‑RPC service can be used for both Dev UI and Dev MCP; methods without a description only show up in Dev UI, while methods with a description appear in both.
ja_jp: エクステンションは、Dev MCP サーバーに追加のツールやリソースを提供できます。統合方法は xref:dev-ui.adoc[Dev UI] への提供と似ていますが、説明 (description) が必須です。単一の JSON‑RPC サービスを Dev UI と Dev MCP の両方に使用できます。説明のないメソッドは Dev UI にのみ表示され、説明のあるメソッドは両方に表示されます。

source: Extensions can contribute entries to the interactive *Quarkus log menu* by integrating with the Dev Assistant. This allows developers to invoke assistant-powered actions directly from the quarkus log using keyboard shortcuts.
ja_jp: エクステンションは Dev Assistant と統合することで、対話型の *Quarkus ログメニュー* にエントリーを追加できます。これにより、開発者はキーボードショートカットを使用して、 Quarkus ログからアシスタント駆動のアクションを直接呼び出すことができます。

source: Extensions can contribute interactive pages to the Dev UI in the following areas:
ja_jp: エクステンションは、以下の領域で Dev UI にインタラクティブなページを貢献できます。

source: Extensions can create a management endpoint by defining a _non application_ route and calling `management()` method:
ja_jp: エクステンションは、 _アプリケーション以外の_ ルートを定義し、 `management()` メソッドを呼び出すことで、マネジメントエンドポイントを作成できます:

source: Extensions can:
ja_jp: エクステンションは可能である：

source: Extensions codestarts in Quarkus Core
ja_jp: Quarkus Coreのエクステンション Codestart

source: Extensions enabled. Only extensions whose `groupIds` start with `io.quarkus`, `io.quarkiverse` or are included in the quarkus platform are collected.
ja_jp: エクステンションが有効かどうか。 `groupIds` が `io.quarkus` か、 `io.quarkiverse` で始まるか、quarkusプラットフォームに含まれているエクステンションのみが収集されます。

source: Extensions have a various degree of maturity when they enter the Quarkus ecosystem. A status offers the expectations you can rely on.
ja_jp: エクステンションは、Quarkusエコシステムに入る際に、さまざまな成熟度を持ちます。ステータスは、信頼度の期待値を提供します。

source: Extensions hosted in the Quarkiverse Hub may or may not end up in the Quarkus platform.
ja_jp: Quarkiverse Hubでホストされているエクステンションは、Quarkusプラットフォームに組み込まれる場合もあれば、組み込まれない場合もあります。

source: Extensions may also declare conditional dependencies on regular Maven artifacts, that are not Quarkus extensions. Given that regular Maven artifacts do not include Quarkus metadata, the condition for their inclusion is configured by an extension depending on them.
ja_jp: エクステンションは、通常の Maven アーティファクト (Quarkus エクステンションではないもの) に対しても条件付き依存関係を宣言できます。通常の Maven アーティファクトには Quarkus のメタデータが含まれていないため、メタデータを含めるかどうかの条件は、依存するエクステンションにより設定されます。

source: Extensions may need to provide a fallback if there is no active metrics extension or the extension doesn't support the API required by the library.
ja_jp: アクティブなメトリクスエクステンションがない場合、またはエクステンションがライブラリーに必要な API をサポートしていない場合、エクステンションはフォールバックを提供しなければならない可能性があります。

source: Extensions may wish to xref:writing-extensions.adoc#extension-defined-endpoints[define library-specific endpoints] for health criteria which are specific to that extension. To add a new endpoint, extensions should produce a `NonApplicationRootPathBuildItem`.
ja_jp: エクステンションでは、そのエクステンションに固有のヘルス基準について xref:writing-extensions.adoc#extension-defined-endpoints[ライブラリー固有のエンドポイントを定義] する必要がある場合があります。新しいエンドポイントを追加するには、エクステンションで `NonApplicationRootPathBuildItem` を生成する必要があります。

source: Extensions moved to Quarkiverse Hub
ja_jp: エクステンションはQuarkiverse Hubに移動しました。

source: Extensions must use https://smallrye.io/smallrye-config/Main/config/mappings/[SmallRye Config @ConfigMapping] to map the configuration required by the Extension. This will allow Quarkus to automatically expose an instance of the mapping to each configuration phase and generate the configuration documentation.
ja_jp: エクステンションは、 link:https://smallrye.io/smallrye-config/Main/config/mappings/[SmallRye Configの@ConfigMapping] を使用して、Extensionが必要とする設定をマッピングする必要があります。これにより、Quarkusは、各設定フェーズにマッピングのインスタンスを自動的に公開し、設定ドキュメントを生成することができます。

source: Extensions often need a way to determine whether a given class is part of the application's runtime classpath. The proper way for an extension to perform this check is to use `io.quarkus.bootstrap.classloading.QuarkusClassLoader.isClassPresentAtRuntime`.
ja_jp: エクステンションでは、多くの場合、特定のクラスがアプリケーションのランタイムクラスパスの一部であるかどうかを判断する方法が必要になります。 エクステンションがこのチェックを実行する適切な方法は、 `io.quarkus.bootstrap.classloading.QuarkusClassLoader.isClassPresentAtRuntime` を使用することです。

source: Extensions often need to register serializers and/or deserializers for types the extension provides.
ja_jp: エクステンションはしばしば、エクステンションが提供する型のシリアライザやデシリアライザを登録する必要があります。

source: Extensions providing Initialization Tasks
ja_jp: 初期化タスクを提供するエクステンション

source: Extensions rely on container image names and exposed ports to discover services. For example, the PostgreSQL Dev Service looks for a service with the image name *containing* `postgres` and the exposed container port `5432`.
ja_jp: エクステンションは、サービスを検出するためにコンテナーイメージ名と公開ポートに依存します。たとえば、PostgreSQL Dev Service は、イメージ名に `postgres` を *含む* サービスと、公開されたコンテナーポート `5432` を探します。

source: Extensions should see the configuration holistically as a Quarkus application instead of focusing on the library experience. For example `quarkus.database.url` and friends are shared between extensions as defining a database access is a shared task (instead of a `hibernate.` property for example). The most useful configuration options should be exposed as `quarkus.[extension].` instead of the natural namespace of the library. Less common properties can live in the library namespace.
ja_jp: エクステンションは、ライブラリの体験に焦点を当てるのではなく、Quarkusアプリケーションとして全体的に設定を見るべきです。例えば、データベースアクセスの定義が共有タスクであるように、 `quarkus.database.url` 等々がエクステンション間で共有されます（例えば `hibernate.` プロパティを使用される代わりに）。最も便利な設定オプションは、ライブラリの自然な名前空間ではなく、 `quarkus.[extension].` として公開されるべきです。あまり一般的ではないプロパティは、ライブラリの名前空間に置くことができます。

source: Extensions should support Quarkus's unified configuration, by xref:writing-extensions.adoc#configuration[integrating with the Quarkus configuration model]. The Writing Extensions guide has more guidance on xref:writing-extensions.adoc#how-to-expose-configuration[the Quarkus configuration philosophy].
ja_jp: エクステンションは、xref:writing-extensions.adoc#configuration[Quarkus 設定モデルとの統合] によって、Quarkus のインテグレーション設定をサポートする必要があります。 エクステンションの作成ガイドには、xref:writing-extensions.adoc#how-to-expose-configuration[Quarkus の設定] に関する詳細なガイダンスが記載されています。

source: Extensions should use build-time application knowledge to eliminate wasteful runtime code paths. We call this supersonic subatomic performance. Because Quarkus moves work to the build stage, Quarkus applications should have fast startup, high throughput, and low memory requirements. Performance tuning is a large subject, but extensions should use build-time application knowledge to eliminate wasteful runtime code paths at runtime.
ja_jp: エクステンションは、ビルド時のアプリケーション情報を活用し、不必要なランタイムのコードパスを排除するべきです。これを Supersonic Subatomic パフォーマンスと呼んでいます。 Quarkus は処理をビルド時に移行して、アプリケーションの 高速な起動、高いスループット、低いメモリ消費を実現します。パフォーマンスチューニングは広範なテーマですが、エクステンションはビルド時のアプリケーション情報を活用し、ランタイムの不要なコードパスを排除することが求められます。

source: Extensions supporting duplicated contexts
ja_jp: 複製コンテキストをサポートするエクステンション

source: Extensions that accept requests need to add support for this on an individual basis. At the moment only the HTTP extension supports this, so shutdown may still happen when messaging requests are active.
ja_jp: リクエストを受け付けるエクステンションは、個別にサポートを追加する必要があります。現時点では HTTP エクステンションだけがこれをサポートしているので、メッセージングリクエストがアクティブなときにシャットダウンが発生する可能性があります。

source: Extensions that are aware of the Proxy Registry use the default proxy. This happens unless a named proxy is explicitly referenced in the configuration of the extension.
ja_jp: プロキシーレジストリーを認識するエクステンションは、名前付きプロキシーがエクステンションの設定で明示的に参照されない限り、デフォルトプロキシーを使用します。

source: Extensions that register providers via build items use the `io.quarkus.resteasy.common.spi.ResteasyJaxrsProviderBuildItem` build item in RESTEasy Classic. With Quarkus REST however, extensions need to use specific build items, such as `io.quarkus.resteasy.reactive.spi.MessageBodyWriterBuildItem` and `io.quarkus.resteasy.reactive.spi.MessageBodyWriterBuildItem`.
ja_jp: ビルド アイテムを介してプロバイダーを登録するエクステンションは、RESTEasy Classic の `io.quarkus.resteasy.common.spi.ResteasyJaxrsProviderBuildItem` ビルド アイテムを使用します。 ただし、Quarkus REST では、エクステンションは `io.quarkus.resteasy.reactive.spi.MessageBodyWriterBuildItem` や `io.quarkus.resteasy.reactive.spi.MessageBodyWriterBuildItem` などの特定のビルド アイテムを使用する必要があります。

source: Extensions that register providers via build items use the `io.quarkus.resteasy.common.spi.ResteasyJaxrsProviderBuildItem` build item in RESTEasy Classic. With RESTEasy Reactive however, extensions need to use specific build items, such as `io.quarkus.resteasy.reactive.spi.MessageBodyWriterBuildItem` and `io.quarkus.resteasy.reactive.spi.MessageBodyWriterBuildItem`.
ja_jp: ビルド アイテムを介してプロバイダーを登録するエクステンションは、RESTEasy Classicの `io.quarkus.resteasy.common.spi.ResteasyJaxrsProviderBuildItem` ビルド アイテムを使用します。 ただし、RESTEasy Reactive では、エクステンションは `io.quarkus.resteasy.reactive.spi.MessageBodyWriterBuildItem` や `io.quarkus.resteasy.reactive.spi.MessageBodyWriterBuildItem` などの特定のビルド アイテムを使用する必要があります。

source: Extensions that support reactive technologies and techniques
ja_jp: リアクティブな技術・技法をサポートするエクステンション

source: External Links
ja_jp: 外部リンク

source: External and Internal Access to OpenID Connect Provider
ja_jp: OpenID Connect プロバイダーへの外部および内部アクセス

source: External and internal access to OIDC providers
ja_jp: OIDC プロバイダーへの外部および内部アクセス

source: External and internal access to the OIDC provider
ja_jp: OIDC プロバイダーへの外部および内部アクセス

source: External application.yaml file
ja_jp: 外部application.yamlファイル

source: External data can be included into the cache key by injecting a CDI bean in the key generator.
ja_jp: キージェネレータにCDI Beanをインジェクトすることで、外部データをキャッシュキーに含めることができます。

source: External links
ja_jp: 外部リンク

source: Extra Build Generated Files
ja_jp: ビルド時に追加生成されるファイル

source: Extra headers
ja_jp: 追加ヘッダー

source: Extra parameters
ja_jp: 追加パラメータ
